#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/laurence/terraform-gh-actions/runs/run-hLBUoVCF95RkyJih

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.laurence-rg: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg]
azurerm_network_security_rule.laurence-dev-nsr: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/networkSecurityGroups/laurence-nsg/securityRules/laurence-dev-nsr]
azurerm_public_ip.laurence-ip: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/publicIPAddresses/laurence-ip]
azurerm_virtual_network.laurence-vn: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/virtualNetworks/laurence-vn]
azurerm_network_security_group.laurence-nsg: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/networkSecurityGroups/laurence-nsg]
azurerm_subnet.laurence-subnet: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/virtualNetworks/laurence-vn/subnets/laurence-subnet]
azurerm_subnet_network_security_group_association.laurence-ssga: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/virtualNetworks/laurence-vn/subnets/laurence-subnet]
azurerm_network_interface.laurence-nic: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/networkInterfaces/laurence-nic]
azurerm_linux_virtual_machine.laurence-vm: Refreshing state... [id=/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Compute/virtualMachines/laurence-vm]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_network_interface.laurence-nic has been deleted
  - resource "azurerm_network_interface" "laurence-nic" {
      - id                            = "/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/networkInterfaces/laurence-nic" -> null
        name                          = "laurence-nic"
        tags                          = {
            "environment" = "dev"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_security_group.laurence-nsg has been deleted
  - resource "azurerm_network_security_group" "laurence-nsg" {
      - id                  = "/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/networkSecurityGroups/laurence-nsg" -> null
      - name                = "laurence-nsg" -> null
        tags                = {
            "environment" = "dev"
        }
        # (3 unchanged attributes hidden)
    }

  # azurerm_public_ip.laurence-ip has been deleted
  - resource "azurerm_public_ip" "laurence-ip" {
      - id                      = "/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/publicIPAddresses/laurence-ip" -> null
        name                    = "laurence-ip"
        tags                    = {
            "environment" = "dev"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_resource_group.laurence-rg has been deleted
  - resource "azurerm_resource_group" "laurence-rg" {
        id       = "/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg"
      - location = "uksouth" -> null
      - name     = "laurence-rg" -> null
        tags     = {
            "environment" = "dev"
        }
    }

  # azurerm_subnet.laurence-subnet has been deleted
  - resource "azurerm_subnet" "laurence-subnet" {
      - id                                             = "/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/virtualNetworks/laurence-vn/subnets/laurence-subnet" -> null
        name                                           = "laurence-subnet"
        # (7 unchanged attributes hidden)
    }

  # azurerm_virtual_network.laurence-vn has been deleted
  - resource "azurerm_virtual_network" "laurence-vn" {
        id                      = "/subscriptions/04a1244d-a5fd-4255-b14c-d5f6b7b9445a/resourceGroups/laurence-rg/providers/Microsoft.Network/virtualNetworks/laurence-vn"
      - name                    = "laurence-vn" -> null
        tags                    = {
            "environment" = "dev"
        }
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.laurence-vm will be created
  + resource "azurerm_linux_virtual_machine" "laurence-vm" {
      + admin_username                  = "laurence.nairne"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + custom_data                     = (sensitive value)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "uksouth"
      + max_bid_price                   = -1
      + name                            = "laurence-vm-production"
      + network_interface_ids           = (known after apply)
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "laurence-rg-production"
      + size                            = "Standard_B1ls"
      + tags                            = {
          + "environment" = "production"
        }
      + virtual_machine_id              = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDosoCASr7Zy+KPZntem3vMcdYgshVeLleDXjpvGmRIqCP4lqGesr9OUYN/9kIdUZy7buBS/7YPEZkA86R40PU3JqtqMfT1TVm0NKuWY9Q7RjHDmQ8w3L62rXUYaOpV66FEBdGAPJ+OmS3FjEnAXuV+TzX81ZGiRf8edxEfZ7foJXc8+Gtl0i1/TYLL+CjVMmjBhPTa4/C7rpXe+Fei8gx/Q3tZ9sZGit9G8iVNnY37u0UbzAlOog2NvLshZq+dvoeEyfYqq8GZEkn3kEHEbMlfWKZ9ARQGm7Cwx7PI1kAHnycRZm+z0eCkOJ3jVD6bPUIS9WI4Qhi+QPgxo44fqQ4EYEwLdMLJ+KE40EIQ0vq6ZX2lUfMvonbs9SdGApk79p86by3tXWwaCL5sS2h1WinnS+9pk3ep626K2xv/lWRHAlO7AGpmuj+NKHeZ+GywvvdsSnApsEyiGCO/Xer0oQeyMBKZOLcjF4fmY77Le80eRi5HhYeHOKvfVDSkarJwRHgP6e2/whRKz6EQmhkkQSJZhKn5YRYDp1C+k7OG/PZE0WewRKpqJ94dmldd1Ur00Umvc6WOLvKQxCODWvfRlYzF4T+lJpArZbkcsPN+9Z8M04Hhm4r6B6d+W7i7Ry+TAjCturMYBMZn16cE4c1fsfUYUJaZNYeE7gMtSzDnS9hXqw== Azure Linux VM"
          + username   = "laurence.nairne"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # azurerm_network_interface.laurence-nic will be created
  + resource "azurerm_network_interface" "laurence-nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "laurence-nic-production"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "laurence-rg-production"
      + tags                          = {
          + "environment" = "production"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.laurence-nsg will be created
  + resource "azurerm_network_security_group" "laurence-nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "laurence-nsg-production"
      + resource_group_name = "laurence-rg-production"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "production"
        }
    }

  # azurerm_network_security_rule.laurence-nsr will be created
  + resource "azurerm_network_security_rule" "laurence-nsr" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "laurence-nsr-production"
      + network_security_group_name = "laurence-nsg-production"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "laurence-rg-production"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.laurence-ip will be created
  + resource "azurerm_public_ip" "laurence-ip" {
      + allocation_method       = "Dynamic"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "laurence-ip-production"
      + resource_group_name     = "laurence-rg-production"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "environment" = "production"
        }
    }

  # azurerm_resource_group.laurence-rg will be created
  + resource "azurerm_resource_group" "laurence-rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "laurence-rg-production"
      + tags     = {
          + "environment" = "production"
        }
    }

  # azurerm_subnet.laurence-subnet will be created
  + resource "azurerm_subnet" "laurence-subnet" {
      + address_prefixes                               = [
          + "10.123.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "laurence-subnet-production"
      + resource_group_name                            = "laurence-rg-production"
      + virtual_network_name                           = "laurence-vn-production"
    }

  # azurerm_subnet_network_security_group_association.laurence-ssga will be created
  + resource "azurerm_subnet_network_security_group_association" "laurence-ssga" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.laurence-vn will be created
  + resource "azurerm_virtual_network" "laurence-vn" {
      + address_space       = [
          + "10.123.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "laurence-vn-production"
      + resource_group_name = "laurence-rg-production"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "production"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @LaurenceNairne, Action: `pull_request`*